brew "imagemagick"
brew "gnupg"

# --- Core CLI Tools ---
brew "git"
brew "wget"
brew "htop"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "gh"               # GitHub CLI
brew "node"
brew "python"
brew "zinit"

brew "go"

brew "diff-so-fancy"
brew "folderify"

# --- Kubernetes Tools ---
brew "kubectl"
brew "k9s"
brew "helm"

# --- GUI Apps ---
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "slack"
cask "raycast"
cask "rectangle"
cask "graphql-playground"

cask "gimp"
cask "inkscape"

# --- Fonts ---
cask "font-fira-code"
cask "font-meslo-for-powerlevel10k"

# --- VS Code Extensions ---
vscode "vscodevim.vim"
