brew "imagemagick"
brew "gnupg"
brew "weasyprint"
brew "poppler"
brew "codespell"
brew "checkbashisms"
brew "yamllint"
brew "pandoc"
cask "mactex"

# --- Core CLI Tools ---
brew "git"
brew "wget"
brew "htop"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "gh"               # GitHub CLI
brew "node"
brew "python"
brew "uv"
brew "zinit"
brew "fd"
brew "bat"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "powerlevel10k"
brew "tree"
brew "colordiff"

brew "go"
brew "golangci-lint"

brew "diff-so-fancy"
brew "folderify"

# --- Additional CLI Tools (moved from zinit) ---
brew "eza"              # Modern replacement for ls (exa successor)
brew "lsd"              # Colorful ls clone
brew "procs"            # Modern replacement for ps
brew "sd"               # Modern replacement for sed
brew "doggo"            # Modern replacement for dig (dog alternative)
brew "glow"             # Markdown renderer
brew "fx"               # JSON viewer
brew "yq"               # YAML processor
brew "sops"             # Secrets management
brew "direnv"           # Environment variable management
brew "chroma"           # Code syntax highlighter

# --- Dev Tools ---
brew "goreleaser"
brew "qemu"

# --- Testing tools ---
brew "httpie"

# --- Kubernetes Tools ---
brew "kubectl"
brew "k9s"
brew "helm"
brew "helmfile"
brew "kustomize"
brew "kind"
brew "cilium-cli"
brew "hubble"
brew "flux"
brew "argocd"
brew "kubeseal"         # Sealed secrets CLI
brew "eksctl"
brew "openshift-cli"

# --- HashiCorp Tools ---
tap "hashicorp/tap"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "terraform-docs"

# --- Labs ---
tap "instruqt/tap"
brew "instruqt"

# --- Cloud Tools ---
# Note: summon not available in Homebrew

# --- Other Tools ---
brew "act"              # Run GitHub Actions locally
brew "opa"              # Open Policy Agent
brew "kubecolor"        # Colorized kubectl output
brew "terraform-docs"   # Generate Terraform docs
brew "cfssl"            # CloudFlare's PKI toolkit
brew "yt-dlp"           # Modern youtube-dl fork
brew "k3d"              # Lightweight Kubernetes in Docker
brew "glab"             # GitLab CLI tool
brew "opentofu"         # Open source Terraform alternative

# --- GUI Apps ---
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "slack"
cask "raycast"
cask "rectangle"
cask "graphql-playground"
cask "docker-desktop"
cask "finicky"

# --- Calendr ---
tap "pakerwreah/calendr"
cask "pakerwreah/calendr/calendr"


cask "gimp"
cask "inkscape"

# --- Fonts ---
cask "font-fira-code"
cask "font-meslo-for-powerlevel10k"

# --- VS Code Extensions ---
vscode "vscodevim.vim"

# --- SDK ---
cask "gcloud-cli"
